# encoding: utf-8
# == Schema Information
#
# Table name: articles
#
#  id                :integer          not null, primary key
#  slug              :string(255)      not null
#  language          :string(255)      not null
#  source            :string(255)
#  source_url        :string(255)
#  category          :string(255)      not null
#  section           :string(255)
#  title             :string(255)      not null
#  description       :text(65535)      not null
#  images            :text(65535)      not null
#  intro             :text(65535)      not null
#  body              :text(65535)      not null
#  author            :string(255)
#  written_on        :date             not null
#  origin_id         :integer
#  uk_translation_id :integer
#  ru_translation_id :integer
#  en_translation_id :integer
#  created_at        :datetime         not null
#  updated_at        :datetime         not null
#

FactoryGirl.define do
  factory :article do
    language 'uk'
    category 'Ціни на нафту'
    section 'Альтернативна енергетика'
    title 'Просто, як Зелений Google'
    body <<-HTML.gsub(/^ {6}/, '')
      <p>Google може мати погану репутацію на політику конфіденційності, але коли справа доходить до зеленого, інтернет-гігант чистий, гризучи більше $ 850 мільйонів інвестицій для розробки та розгортання екологічно чистої енергії і заробляти перше місце в списку Грінпіс ІТ гігантів, які використовуючи і пропаганда екологічно чистої енергії.</p>

      <p>У лютому, Грінпіс ранг компанії Google є кращим її &quot;Cool IT лідерів&quot;, хоча це тільки забив 53 з 100 пунктів на рейтинговій системі, як і раніше поставивши його попереду Cisco, з 49 пунктів. Але це було неохоче подарунок від Грінпіс, ​​яка була цькування ІТ гіганта протягом деякого часу над своїми давно назрілих кроків перейти на зелений і використовувати свій вплив і охоплення виступати за поновлювані джерела енергії.</p>

      <p>Google, можливо, отримав до повільного зеленого початку, але в довгостроковій перспективі, ІТ-гігант повинні отримувати вигоду від переїзду. В даний час пошуку більш 20% свого глобального використання енергії з зелених джерел, таких як енергія сонця і вітру. Як один з найбільших споживачів енергії, скорочення споживання допоможе його прибутку і її чисті зусилля на енергоносії повинні підвищити свій суспільний імідж, в той час, коли Google загрузла в судових над політикою конфіденційності.</p>

      <p>І вплив компанії Google не слід недооцінювати, чого Грінпіс добре розуміє. Мало того, що Google збирається зеленим, це також втручаються в політичні ініціативи, пропонуючи свої власні чисті пропозиції енергії для розгляд уряду (наприклад, неподалік від видалення залежність США від викопного палива повністю в межах 22 років).</p>

      <p>Досі Google вклала $ 10 млн у двох сонячних компаній, eSolar і BrightSource, і створив фонд з SolarCity в Каліфорнії для встановлення сонячних панелей в 9000 будинків на варіант оренди $ 280 млн.. ІТ-гігант вклав ще $ 15 млн. в енергії вітру, і $ 10 млн в удосконалених систем геотермальних. Найголовніше, Google Ventures запустила фонд венчурного капіталу $ 100 млн. на інноваційні чисті технології стартапів. Крім цього, ІТ-гігант прагне набіг в комунальному секторі, застосовуючи для ліцензією на продаж об&#39;ємну електрику. Розумні мережі і плагін автомобілів також у своєму списку зелених проектів, а цілий ряд ризиковані підприємства, в тому числі роботи на геліостатами - дзеркальний пристрій, який направляє сонячні промені для створення теплової енергії - і висотний політ вітрових турбін .</p>

      <p>Хоча Google і інші ІТ-гіганти, такі як Cisco, Ericsson і чистої використання енергії Dell початку Грінпіс і список пропагандистської діяльності, екологічних груп говорить, що є ще недостатня кількість руху з точки зору вирішення проблем забруднення. &quot;Google очолює таблицю, тому що це покласти свої гроші туди, де є шляхом відкачування інвестицій в поновлювані джерела енергії&quot;, сказав Грінпіс Інтернешнл аналітик Гарі Кук журналістам на випуску &quot;Cool IT лідерів.&quot; Проте, за його словами, в той час як ІТ-індустрії є рушійною значний попит на енергію зі своїми центрами обробки даних і глобальної інфраструктури, коли справа доходить до вирішення проблем забруднення, дії був повільним.</p>

      <p>Звичайно, початкові плани компанії Google для енергії були знижені, і багато хто з більш еклектичних проектів компанії один раз, передбачених були скасовані як результати не були майбутніми, як передбачено. Тим не менш, компанія в даний час більше інвестувати в екологічно чисту енергію, ніж будь-коли - справді, в десять разів більше, ніж у 2010 році. Це чудове сума для ІТ-компанії, коли ви порівнюєте його з інвестицій у відновлювану енергетику в енергетичних гігантів, таких як BP, наприклад, які інвестували близько $ 1,6 млрд. в 2010 році. Фокус компанії Google змістився з еклектичним до практичної, зсув найбільш чітко бачили в своєму прагненні розгорнути комерційні сонячні батареї і вітряні турбіни - Інвестиції, які обіцяють повернення.</p>

      <p>В області чистої енергії і приводом США, щоб зменшити залежність від іноземних імпорту палива, Google та інші ІТ-гіганти могли володіти значна кількість впливу, як на громадськість і від політики. Тепер, що ІТ-гіганти в основному на борту з ініціативою чистої енергії - при тому, що журі все ще відсутній на Apple, і Oracle - це імпульс повинен підібрати темп.</p>
    HTML
  end
end
